diffuser_chain/basic_elements/vane_diffuser/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;

#include "meshParameters"

vertices
(
    ( $xin  $yl  -0.5)
    ($xout  $yl  -0.5)
    ($xout  $yu  -0.5)
    ( $xin  $yu  -0.5)
    ( $xin  $yl   0.5)
    ($xout  $yl   0.5)
    ($xout  $yu   0.5)
    ( $xin  $yu   0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($hm $vm 1) 
    simpleGrading 
    (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type inlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type outlet;
        faces
        (
            (2 6 5 1)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
