diffuser_chain/basic_elements/vane_diffuser/system/snappy_parameters
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
refledge   3;
refl   3;
reflcurvature   3;
blthickness   0.0001;
