diffuser_chain/basic_elements/vane_diffuser/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

single_vanem.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       170;
}
single_vaneu.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       170;
}
single_vanel.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       170;
}
dwallu.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       170;
}
dwalll.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       170;
}

// ************************************************************************* //
